IDEA Open Model
ExposureClassesDataEc2 Properties
Compatible with IDEA StatiCa v 10.1
The ExposureClassesDataEc2 type exposes the following members.
Properties
Name | Description
Carbonation
 Combo box Carbonation
CarbonationCheck
 Check box Carbonation
FreezeAttack
 Combo box Freeze/Thaw Attack
FreezeAttackCheck
 Check box Freeze/Thaw Attack
ChemicalAttack
 Combo box Chemical Attack
ChemicalAttackCheck
 Check box Chemical Attack
Chlorides
 Combo box Chlorides
ChloridesFromSea
 Combo box Chlorides from sea
ChloridesFromSeaCheck
 Check box Chlorides from sea
ChloridesCheck
 Check box Chlorides
NoCorrosionCheck
 Check box No corrosion
Top
See Also
Reference
ExposureClassesDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace